app/views/articles/show.html.erb

SELECT  "comments".* FROM "comments" WHERE "comments"."article_id" = 54 LIMIT ?  [["LIMIT", 1]]
---
    <h3>Comments</h3>
    <% comments = Comment.where(article: @article[:id]) %>