app/controllers/api/v1/articles_controller.rb

SELECT "articles".* FROM "articles"
---
			def index
				articles = Article.all;

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
---
			def show
				article = Article.find(params[:id])

INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Barry Allen"], ["text", "Superspeed"], ["created_at", "2018-01-05 07:34:07.955483"], ["updated_at", "2018-01-05 07:34:07.955483"]]
---
			def create
				article = Article.new(article_params)
				if article.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 15]]
---
			def destroy
				article = Article.find(params[:id])
				article.destroy

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "text" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "Barry Allen"], ["text", "Text"], ["updated_at", "2018-01-05 10:00:31.863048"], ["id", 14]]
---
			def update
				article = Article.find(params[:id])
				if article.update_attributes(article_params)