app/controllers/articles_controller.rb

  def create
    article = Article.create(params.require(:article).permit(:title, :text))
---
INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Hi"], ["text", "I am Shivansh"], ["created_at", "2018-01-02 10:00:28.614206"], ["updated_at", "2018-01-02 10:00:28.614206"]]

  def destroy
    article = Article.find(params[:id])
    article.destroy
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 5]]

  def update
    article = Article.find(params[:id])
    if article.update_attributes(params.require(:article).permit(:title, :text))
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "text" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "123"], ["text", "OneTwoThree"], ["updated_at", "2018-01-02 10:37:18.585352"], ["id", 5]]