app/controllers/comments_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."article_id" = ? AND "comments"."id" = ? LIMIT ?  [["article_id", 1], ["id", 1], ["LIMIT", 1]]
---
  	def destroy
	    @article = Article.find(params[:article_id])
	    @comment = @article.comments.find(params[:id])