app/controllers/comments_controller.rb

  def create
    @article = Article.find(params[:article_id])
    @comment = Comment.create(comment_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "Shivansh"], ["body", "Hi Bro"], ["article_id", 1], ["created_at", "2018-01-02 10:58:07.927303"], ["updated_at", "2018-01-02 10:58:07.927303"]]

  def update
    comment = Comment.find(params[:id])
    if comment.update_attributes(params.require('comment').permit(:commenter, :body))
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 55], ["LIMIT", 1]]
UPDATE "comments" SET "commenter" = ?, "body" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["commenter", "hih"], ["body", "hhi"], ["updated_at", "2018-01-09 04:51:02.097338"], ["id", 55]]