app/controllers/users_controller.rb

  def new
    user = User.new(user_params)
    if(user.save)
---
INSERT INTO "users" ("username", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "one"], ["password", "one"], ["created_at", "2018-01-04 18:10:04.506307"], ["updated_at", "2018-01-04 18:10:04.506307"]]

 	def check
 		@user = user_params
 		@users = User.all
---
SELECT "users".* FROM "users"

  def destroy
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]